## 722713121070: Alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.billing_change_over_threshold will be created
  + resource "aws_cloudwatch_metric_alarm" "billing_change_over_threshold" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:722713121070:cloudwatch_alarm_cbs",
        ]
      + alarm_description                     = "Estimated billing anomaly"
      + alarm_name                            = "BillingChangeOverThreshold"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanUpperThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:722713121070:cloudwatch_alarm_cbs",
        ]
      + tags_all                              = (known after apply)
      + threshold_metric_id                   = "anomaly"
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "current"
          + label       = "Current charges"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "Currency" = "USD"
                }
              + metric_name = "EstimatedCharges"
              + namespace   = "AWS/Billing"
              + period      = 21600
              + stat        = "Maximum"
            }
        }
      + metric_query {
          + expression  = "ANOMALY_DETECTION_BAND(current)"
          + id          = "anomaly"
          + label       = "Billing (Expected)"
          + return_data = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.billing_change_over_threshold"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_lambda_function.notify_slack"]

13 tests, 8 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
